Update on NB-IoT readme
